Qwen3ForCausalLM(
  (model): Qwen3Model(
    (embed_tokens): Embedding(151936, 1024)
    (rotary_emb): Qwen3RotaryEmbedding()
    (layers): ModuleList(
      (0-27): 28 x Qwen3DecoderLayer(
        (residual_0_start)
        (input_layernorm): Qwen3RMSNorm((1024,), eps=1e-06)
        (self_attn): Qwen3Attention(
          (q_proj): Linear(in_features=1024, out_features=2048, bias=False)
          (k_proj): Linear(in_features=1024, out_features=1024, bias=False)
          (v_proj): Linear(in_features=1024, out_features=1024, bias=False)
          (o_proj): Linear(in_features=2048, out_features=1024, bias=False)
          (q_norm): Qwen3RMSNorm((128,), eps=1e-06)
          (k_norm): Qwen3RMSNorm((128,), eps=1e-06)
        )
        (residual_0_end)
        (residual_1_start)
        (post_attention_layernorm): Qwen3RMSNorm((1024,), eps=1e-06)
        (mlp): Qwen3MLP(
          (gate_proj): Linear(in_features=1024, out_features=3072, bias=False)
          (up_proj): Linear(in_features=1024, out_features=3072, bias=False)
          (down_proj): Linear(in_features=3072, out_features=1024, bias=False)
          (act_fn): SiLU()
        )
        (residual_1_end)
      )
    )
    (norm): Qwen3RMSNorm((1024,), eps=1e-06)
  )
  (lm_head): Linear(in_features=1024, out_features=151936, bias=False)
)
